[
  {
    "company": "Esco - Bintan, Indonesia",
    "role": "Web Developer (November 2023 - present)",
    "description": [
      "Currently working on MES at Esco Bintan Indonesia, developing the front-end for Production Planners and Operators using React and TypeScript. The system replaces Hydra and is expected to enhance user experience by 50%. Optimized performance for large data sets by implementing virtualization combined with infinite scrolling using TanStack libraries and other performance-enhancing techniques.",
      "Also contributed to building a CMS for Esco’s main website (escolifesciences) using Laravel and Vue to enable dynamic content management and eliminate the need for direct database access. Assisted in improving other Esco platforms, including Esco Career, Esco Medical, and Esco Aster, using various tools such as CodeIgniter and MySQL, in collaboration with cross-functional teams."
    ]
  },
  {
    "company": "Freelancer – Remote",
    "role": "Software Developer (February 2024 - present)",
    "description": [
      "Implemented modules including cashier POS, profit calculation, and petty cash tracking using CodeIgniter and MySQL."
    ]
  },
  {
    "company": "LearningX – Remote",
    "role": "Web Development Mentor (February 2023 – January 2024)",
    "description": [
      "Taught vocational high school students website development from the ground up to an intermediate level using tools such as Flask, Python, and JavaScript. Introduced web-scraping techniques to deepen their understanding of data collection and analysis within the context of web development. Also mentored students on best practices in version control using Git, and guided them in using Jinja templating to build dynamic and responsive web applications."
    ]
  },
  {
    "company": "GITS.ID – Bandung, Indonesia",
    "role": "Software Engineer Internship (February 2022 – August 2022)",
    "description": [
      "Analyzed business processes within the GITS Project Profitability System to identify areas for improved efficiency and performance. Conducted requirement-gathering sessions through interviews with multiple divisions to ensure seamless system integration. Developed applications using the AdonisJS framework and PostgreSQL database to support operational needs. Contributed to enhancing the overall system, resulting in increased productivity and more streamlined workflows."
    ]
  }
]
